thebook/webhooks/tests/paypal/sample_payloads/webhook__brl_payload.json

{
  "id": "WH-4FS819489P2570542-82M42736RY4782436",
  "event_version": "1.0",
  "create_time": "2026-02-13T10:10:15.807Z",
  "resource_type": "sale",
  "event_type": "PAYMENT.SALE.COMPLETED",
  "summary": "Payment completed for R$ 85.0 BRL",
  "resource": {
    "id": "35R35201NA4015510",
    "state": "completed",
    "amount": {
      "total": "85.00",
      "currency": "BRL",
      "details": {
        "subtotal": "85.00"
      }
    },
    "payment_mode": "INSTANT_TRANSFER",
    "protection_eligibility": "ELIGIBLE",
    "protection_eligibility_type": "ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE",
    "transaction_fee": {
      "value": "4.67",
      "currency": "BRL"
    },
    "invoice_number": "",
    "billing_agreement_id": "I-BBBBBBBBBBBB",
    "create_time": "2026-02-13T10:10:10Z",
    "update_time": "2026-02-13T10:10:10Z",
    "links": [
      {
        "href": "https://api.paypal.com/v1/payments/sale/35R35201NA4015510",
        "rel": "self",
        "method": "GET"
      },
      {
        "href": "https://api.paypal.com/v1/payments/sale/35R35201NA4015510/refund",
        "rel": "refund",
        "method": "POST"
      }
    ],
    "soft_descriptor": "LHCCAMPINAS"
  },
  "links": [
    {
      "href": "https://api.paypal.com/v1/notifications/webhooks-events/WH-4FS819489P2570542-82M42736RY4782436",
      "rel": "self",
      "method": "GET"
    },
    {
      "href": "https://api.paypal.com/v1/notifications/webhooks-events/WH-4FS819489P2570542-82M42736RY4782436/resend",
      "rel": "resend",
      "method": "POST"
    }
  ]
}
